server/app/jobs/down_bidding_job.rb

UPDATE "biddings" SET "status" = $1, "updated_at" = $2 WHERE "biddings"."id" = $3  [["status", 1], ["updated_at", "2021-04-10 18:45:14.929372"], ["id", 1]]
---
  def perform(bidding)
    bidding.update(status: :finished)