server/app/controllers/api/v1/biddings_controller.rb

SELECT "biddings".* FROM "biddings" WHERE "biddings"."status" = $1  [["status", 0]]
---
  def index
    authorize Bidding
    biddings = Bidding.where(status: :registered)

SELECT  "biddings".* FROM "biddings" WHERE "biddings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "historic_user_biddings".* FROM "historic_user_biddings" WHERE "historic_user_biddings"."id" = $1  [["id", 9]]
---
  def show
    authorize Bidding
    records = HistoricUserBidding.where(id: @bidding.id)

INSERT INTO "biddings" ("initial_date", "final_date", "starting_price", "status", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    authorize Bidding
    @bidding = Bidding.new(create_bidding_params)
    if @bidding.save

UPDATE "biddings" SET "actual_price" = $1, "user_id" = $2, "updated_at" = $3 WHERE "biddings"."id" = $4  [["actual_price", "1000.0"], ["user_id", 1], ["updated_at", "2021-04-12 05:43:01.718338"], ["id", 10]]
INSERT INTO "historic_user_biddings" ("user_id", "bidding_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["bidding_id", 9], ["status", 0], ["created_at", "2021-04-12 05:40:47.421981"], ["updated_at", "2021-04-12 05:40:47.421981"]]
---
  def update
    authorize Bidding
    if (update_bidding_params[:actual_price].to_i > @bidding.actual_price.to_i && update_bidding_params[:actual_price].to_i > @bidding.starting_price.to_i)
      if @bidding.update(update_bidding_params)
        HistoricUserBidding.create!(user_id: update_bidding_params[:user_id], bidding_id: @bidding.id, status: @bidding.status)

SELECT  "biddings".* FROM "biddings" WHERE "biddings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_bidding
      @bidding = Bidding.find(params[:id])