server/app/controllers/api/v1/sessions_controller.rb

SELECT  "permissions".* FROM "permissions" WHERE "permissions"."action" = $1 LIMIT $2  [["action", "sign_in"], ["LIMIT", 1]]
---
  def can_login?(user)
    user.permissions.include?(Permission.find_by_action('sign_in'))