server/app/controllers/api/v1/users_controller.rb

  def index
    data = {
      users: User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "last_name", "role_id", "email", "password_digest", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"