server/app/models/user.rb

    def init
      self.role_id  ||= Role.find_by_name('seller').id
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "seller"], ["LIMIT", 1]]

    def has_permission?(action)
      permission = Permission.find_by(action: action)
---
SELECT  "permissions".* FROM "permissions" WHERE "permissions"."action" = $1 LIMIT $2  [["action", "sign_in"], ["LIMIT", 1]]