server/app/seed_builders/permission_seed_builder.rb

INSERT INTO "permissions" ("action", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["action", "sign_in"], ["description", "Ingresar a la plataforma"], ["created_at", "2021-04-09 03:53:10.856890"], ["updated_at", "2021-04-09 03:53:10.856890"]]
SELECT  "permissions".* FROM "permissions" WHERE "permissions"."action" = $1 LIMIT $2  [["action", "sign_in"], ["LIMIT", 1]]
---
  def create
    Permission.create(action: 'sign_in', description: 'Ingresar a la plataforma') unless Permission.find_by_action('sign_in').present?