server/app/seed_builders/role_seed_builder.rb

  def create
    Role.create(name: 'admin') unless Role.find_by_name('admin').present?
    Role.create(name: 'seller') unless Role.find_by_name('seller').present?
    # Add permissions to roles
    Role.find_by_name(:admin).permissions = Permission.all
---
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "admin"], ["created_at", "2021-04-09 03:53:10.878841"], ["updated_at", "2021-04-09 03:53:10.878841"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "admin"], ["LIMIT", 1]]
INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "seller"], ["created_at", "2021-04-09 03:53:10.885493"], ["updated_at", "2021-04-09 03:53:10.885493"]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "seller"], ["LIMIT", 1]]